content/algorithm_sites.org
#+TITLE: algorithm

* Training Sites
** 대회종류
*** atcode
https://atcoder.jp/
AtCoder Grand Contest (AGC): 일반 대회보다 문제 수가 한두 개 더 많으며 시간도 길다. 문제 난이도 범위가 넓다. 모든 참가자가 rated이다.
AtCoder Regular Contest (ARC): 보통 4문제 100분이다. 레이팅 2,800 미만인 사람만 rated이다. ARC가 있는 날에는 보통 동시에 ABC가 있다.
AtCoder Beginner Contest (ABC): 역시 보통 4문제 100분이다. 레이팅 1,200 미만인 사람만 rated이다.
by: https://koosaga.com/217
: 강력 추천 AtCoder: 까일 부분이 딱히 없는 아주 좋은 사이트입니다. 문제 수준도 높고 풀이도 항상 제공하고 채점도 잘 됩니다. 문제 수준의 하한이 높다는 점이 특히 강점입니다. 앳코더는 진행 상황을 볼 수 있는 Atcoder Problems 라는 사이트가 있는데 이게 정말 좋습니다. 나쁜 문제가 별로 없고, 문제 난이도도 다양한 편이라, 세로 줄 하나 잡고 올클 스터디 해도 좋아요.

*** atcode problems
https://kenkoooo.com/atcoder/?user=koosaga#/table/
추천 Codeforces: 툭하면 까이지만 그래도 이만한 사이트가 없습니다. 비합리성이 꽤 있으나 (semi-rated 사건 등), 그래도 2018년 기준으로 문제 수준도 괜찮고 풀이도 다 제공합니다. 특히 (적당히 거른다는 가정 하에) 커뮤니티에 유용한 정보가 꽤 많습니다.

*** Code force
 https://codeforces.com/problemset
Div. 1은 1,900 이상(=purple 및 그 이상)인 사람이 참가할 수 있다.
Div. 2는 2,100 미만(=purple 및 그 이하)인 사람이 참가할 수 있다.
Div. 3은 1,600 미만(=cyan 및 그 이하)인 사람이 참가할 수 있다. (2019/04 기준)
https://namnamseo.tistory.com/entry/PS-계열-커뮤니티와-웹-사이트

*** Leet code
리트코드는 해외 취업용 + 속도/메모리를 이것저것 시험해보고 싶을 때 좋다
**** 초급작 코스 추천
https://leetcode.com/explore/
**** 하루 한문제 첼린지
https://inner-game.tistory.com/483

* Code tip
#+BEGIN_SRC C++
 #include <bits/stdc++.h>
#+END_SRC


- gcc 4.8.5 -O0
- cooley-turkey fft, persistent segment tree등
- 카라추바, encoding, decoding 허프만
- cpp 14


* 떠도는 공부 팁
https://baactree.tistory.com/52
