algorithm_sites.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>algorithm</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">algorithm</h1>

<div id="outline-container-org258b5fb" class="outline-2">
<h2 id="org258b5fb">Training Sites</h2>
<div class="outline-text-2" id="text-org258b5fb">
</div>
<div id="outline-container-org7172881" class="outline-3">
<h3 id="org7172881">대회종류</h3>
<div class="outline-text-3" id="text-org7172881">
</div>
<div id="outline-container-org8b3543b" class="outline-4">
<h4 id="org8b3543b">atcode</h4>
<div class="outline-text-4" id="text-org8b3543b">
<p>
<a href="https://atcoder.jp/">https://atcoder.jp/</a>
AtCoder Grand Contest (AGC): 일반 대회보다 문제 수가 한두 개 더 많으며 시간도 길다. 문제 난이도 범위가 넓다. 모든 참가자가 rated이다.
AtCoder Regular Contest (ARC): 보통 4문제 100분이다. 레이팅 2,800 미만인 사람만 rated이다. ARC가 있는 날에는 보통 동시에 ABC가 있다.
AtCoder Beginner Contest (ABC): 역시 보통 4문제 100분이다. 레이팅 1,200 미만인 사람만 rated이다.
by: <a href="https://koosaga.com/217">https://koosaga.com/217</a>
</p>
<pre class="example">
강력 추천 AtCoder: 까일 부분이 딱히 없는 아주 좋은 사이트입니다. 문제 수준도 높고 풀이도 항상 제공하고 채점도 잘 됩니다. 문제 수준의 하한이 높다는 점이 특히 강점입니다. 앳코더는 진행 상황을 볼 수 있는 Atcoder Problems 라는 사이트가 있는데 이게 정말 좋습니다. 나쁜 문제가 별로 없고, 문제 난이도도 다양한 편이라, 세로 줄 하나 잡고 올클 스터디 해도 좋아요.

</pre>
</div>
</div>

<div id="outline-container-org44f2c6f" class="outline-4">
<h4 id="org44f2c6f">atcode problems</h4>
<div class="outline-text-4" id="text-org44f2c6f">
<p>
<a href="https://kenkoooo.com/atcoder/?user=koosaga#/table/">https://kenkoooo.com/atcoder/?user=koosaga#/table/</a>
추천 Codeforces: 툭하면 까이지만 그래도 이만한 사이트가 없습니다. 비합리성이 꽤 있으나 (semi-rated 사건 등), 그래도 2018년 기준으로 문제 수준도 괜찮고 풀이도 다 제공합니다. 특히 (적당히 거른다는 가정 하에) 커뮤니티에 유용한 정보가 꽤 많습니다.
</p>
</div>
</div>

<div id="outline-container-orgd0de9fe" class="outline-4">
<h4 id="orgd0de9fe">Code force</h4>
<div class="outline-text-4" id="text-orgd0de9fe">
<p>
 <a href="https://codeforces.com/problemset">https://codeforces.com/problemset</a>
Div. 1은 1,900 이상(=purple 및 그 이상)인 사람이 참가할 수 있다.
Div. 2는 2,100 미만(=purple 및 그 이하)인 사람이 참가할 수 있다.
Div. 3은 1,600 미만(=cyan 및 그 이하)인 사람이 참가할 수 있다. (2019/04 기준)
<a href="https://namnamseo.tistory.com/entry/PS-%EA%B3%84%EC%97%B4-%EC%BB%A4%EB%AE%A4%EB%8B%88%ED%8B%B0%EC%99%80-%EC%9B%B9-%EC%82%AC%EC%9D%B4%ED%8A%B8">https://namnamseo.tistory.com/entry/PS-계열-커뮤니티와-웹-사이트</a>
</p>
</div>
</div>

<div id="outline-container-org3e075d2" class="outline-4">
<h4 id="org3e075d2">Leet code</h4>
<div class="outline-text-4" id="text-org3e075d2">
<p>
리트코드는 해외 취업용 + 속도/메모리를 이것저것 시험해보고 싶을 때 좋다
</p>
</div>
<ul class="org-ul">
<li><a id="orga181a7c"></a>초급작 코스 추천<br />
<div class="outline-text-5" id="text-orga181a7c">
<p>
<a href="https://leetcode.com/explore/">https://leetcode.com/explore/</a>
</p>
</div>
</li>
<li><a id="org611c0ab"></a>하루 한문제 첼린지<br />
<div class="outline-text-5" id="text-org611c0ab">
<p>
<a href="https://inner-game.tistory.com/483">https://inner-game.tistory.com/483</a>
</p>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0c3ca2b" class="outline-2">
<h2 id="org0c3ca2b">Code tip</h2>
<div class="outline-text-2" id="text-org0c3ca2b">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;bits/stdc++.h&gt;</span>
</pre>
</div>


<ul class="org-ul">
<li>gcc 4.8.5 -O0</li>
<li>cooley-turkey fft, persistent segment tree등</li>
<li>카라추바, encoding, decoding 허프만</li>
<li>cpp 14</li>
</ul>
</div>
</div>


<div id="outline-container-org686b647" class="outline-2">
<h2 id="org686b647">떠도는 공부 팁</h2>
<div class="outline-text-2" id="text-org686b647">
<p>
<a href="https://baactree.tistory.com/52">https://baactree.tistory.com/52</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
